1.1

In [95]:
import pandas as pd
import numpy as np
lst1=[1,2,3,4,5]
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']},index=lst1)

In [96]:
print(df)

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [97]:
a=np.where(df['FlightNumber']==10045)
df.iloc[a]

        From_To  FlightNumber RecentDelays Airline
1  LoNDon_paris       10045.0     [23, 47]  KLM(!)

In [98]:
lst1=[10055,10075]
for i in lst1:
    df['FlightNumber'].fillna(i,limit=1,inplace=True)

In [99]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1.2

In [85]:
pw=df['From_To'].str.split('_',expand=True)

In [89]:
pw.columns=['from','To']

In [91]:
pw

       from         To
1    LoNDon      paris
2    MAdrid      miLAN
3    londON  StockhOlm
4  Budapest      PaRis
5  Brussels     londOn

1.3

In [92]:
pw['from']=pw['from'].str.capitalize()

In [93]:
pw

       from         To
1    London      paris
2    Madrid      miLAN
3    London  StockhOlm
4  Budapest      PaRis
5  Brussels     londOn

1.4

In [101]:
df.join(pw).drop('From_To',axis=1,)

   FlightNumber  RecentDelays              Airline      from         To
1       10045.0      [23, 47]               KLM(!)    London      paris
2       10055.0            []    <Air France> (12)    Madrid      miLAN
3       10065.0  [24, 43, 87]  (British Airways. )    London  StockhOlm
4       10075.0          [13]       12. Air France  Budapest      PaRis
5       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

1.5

In [106]:
df3 = df.RecentDelays.apply(pd.Series)
df3.columns=['delay1','delay2','delay3']

In [107]:
df3

   delay1  delay2  delay3
1    23.0    47.0     NaN
2     NaN     NaN     NaN
3    24.0    43.0    87.0
4    13.0     NaN     NaN
5    67.0    32.0     NaN

In [108]:
df.join(df3)

,From_To,FlightNumber,RecentDelays,Airline,delay1,delay2,delay3
1,LoNDon_paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
2,MAdrid_miLAN,10055.0,[],<Air France> (12),NaN,NaN,NaN
3,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
4,Budapest_PaRis,10075.0,[13],12. Air France,13.0,NaN,NaN
5,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",67.0,32.0,NaN